app/src/main/resources/observation.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope
    xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.w3.org/2003/05/soap-envelope http://www.w3.org/2003/05/soap-envelope/soap-envelope.xsd">
    <env:Body>
        <sos:InsertObservation
            xmlns:sos="http://www.opengis.net/sos/2.0"
            xmlns:swes="http://www.opengis.net/swes/2.0"
            xmlns:swe="http://www.opengis.net/swe/2.0"
            xmlns:sml="http://www.opengis.net/sensorML/1.0.1"
            xmlns:gml="http://www.opengis.net/gml/3.2"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            xmlns:om="http://www.opengis.net/om/2.0"
            xmlns:sams="http://www.opengis.net/samplingSpatial/2.0"
            xmlns:sf="http://www.opengis.net/sampling/2.0" service="SOS" version="2.0.0" xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sos.xsd            http://www.opengis.net/samplingSpatial/2.0 http://schemas.opengis.net/samplingSpatial/2.0/spatialSamplingFeature.xsd">
            <sos:offering>${offering}</sos:offering>
            <sos:observation>
                <om:OM_Observation gml:id="${observationId}">
                    <gml:description>Measurement</gml:description>
                    <gml:identifier codeSpace="">${observationIdentifier}</gml:identifier>
                    <om:type xlink:href="http://www.opengis.net/def/observationType/OGC-OM/2.0/OM_ComplexObservation"/>
                    <om:phenomenonTime>
                        <gml:TimeInstant gml:id="phenomenonTime">
                            <gml:timePosition>${time}</gml:timePosition>
                        </gml:TimeInstant>
                    </om:phenomenonTime>
                    <om:resultTime xlink:href="#phenomenonTime"/>
                    <om:procedure xlink:href="${sensorIdentifier}"/>
                    <om:observedProperty xlink:href="http://www.mowesta.com/measurement"/>
                    <om:featureOfInterest>
                        <sams:SF_SpatialSamplingFeature gml:id="${featureId}">
                            <gml:identifier codeSpace="">${featureIdentifier}</gml:identifier>
                            <sf:type xlink:href="http://www.opengis.net/def/samplingFeatureType/OGC-OM/2.0/SF_SamplingPoint"/>
                            <sf:sampledFeature xlink:href="${feature}"/>
                            <sams:shape>
                                <gml:Point gml:id="point">
                                    <gml:pos srsName="http://www.opengis.net/def/crs/EPSG/0/4326">${position}</gml:pos>
                                </gml:Point>
                            </sams:shape>
                        </sams:SF_SpatialSamplingFeature>
                    </om:featureOfInterest>
                    <om:result xsi:type="swe:DataRecordPropertyType">
                        <swe:DataRecord>
                            <swe:field name="Temperature">
                                <swe:Quantity definition="http://www.mowesta.com/temperature">
                                    <swe:uom code="°C"/>
                                    <swe:value>${temperature}</swe:value>
                                </swe:Quantity>
                            </swe:field>
                            <swe:field name="Pressure">
                                <swe:Quantity definition="http://www.mowesta.com/pressure">
                                    <swe:uom code="hPA"/>
                                    <swe:value>${pressure}</swe:value>
                                </swe:Quantity>
                            </swe:field>
                            <swe:field name="Humidity">
                                <swe:Quantity definition="http://www.mowesta.com/humidity">
                                    <swe:uom code="%"/>
                                    <swe:value>${humidity}</swe:value>
                                </swe:Quantity>
                            </swe:field>
                        </swe:DataRecord>
                    </om:result>
                </om:OM_Observation>
            </sos:observation>
        </sos:InsertObservation>
    </env:Body>
</env:Envelope>
